In [11]:
# Iniciar

# Crear DataFrames

In [12]:
import pandas as pd

In [13]:
canalventa = pd.read_excel('Homework/CanalDeVenta.xlsx')
canalventa

# pip install openpyxl

   CODIGO DESCRIPCION
0       1  Telefónica
1       2      OnLine
2       3  Presencial

In [14]:
clientesbkp = pd.read_csv("Homework/Clientes_bkp.csv",sep=";",decimal=",")
clientesbkp.head()

,ID,Provincia,Nombre_y_Apellido,Domicilio,Telefono,Edad,Localidad,X,Y,col10
0,1,Buenos Aires,HEBER JONI SANTANA,LAS HERAS Y BAT. 24 DE FEBRERO 4150 RINCON DE...,42-5161,58,LOMA VERDE,-58.818503,-34.309971,NaN
1,2,Buenos Aires,ANA SAPRIZA,PUEYRREDON Y DUPUY RUTA3 KM 52.500 S/N BÂº LO...,49-7578,61,SANTA ROSA,-58.730738,-34.939083,NaN
2,3,Buenos Aires,FERNANDO LUIS SARALEGUI,CALDERON DE LA BARCA 498,49-3435,15,TORRES,-59.127941,-34.430822,NaN
3,4,Buenos Aires,MANUELA SARASOLA,"RUTA 36 KM 45,500 S/N EL PELIGRO",49-2883,29,RUTA SOL,-58.143940,-34.920527,NaN
4,5,Buenos Aires,MARIO RAÚL SARASUA,492 Y 186 S/N COLONIA URQUIZA,491-4608,34,JOSE MELCHOR ROMERO,-58.089381,-34.944447,NaN

In [35]:
clientes = pd.read_csv("Homework/Clientes.csv",sep=";",decimal=",")
clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3407 entries, 0 to 3406
Data columns (total 15 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ID                           3407 non-null   int64
 1   Provincia                    3376 non-null   object
 2   Nombre_y_Apellido            3361 non-null   object
 3   Domicilio                    3359 non-null   object
 4   Telefono                     3317 non-null   object
 5   Edad                         3407 non-null   int64
 6   Localidad                    3375 non-null   object
 7   X                            3345 non-null   float64
 8   Y                            3347 non-null   float64
 9   Fecha_Alta                   3407 non-null   object
 10  Usuario_Alta                 3407 non-null   object
 11  Fecha_Ultima_Modificacion    3407 non-null   object
 12  Usuario_Ultima_Modificacion  3407 non-null   object
 13  Marca_Baja                   3407 non-null   int64
 14  col10                        0 non-null      float64
dtypes: float64(3), int64(3), object(9)
memory usage: 399.4+ KB

In [17]:
empleados = pd.read_excel("Homework/Empleados.xls")
empleados.head()

# pip install xlrd

,ID_empleado,Apellido,Nombre,Sucursal,Sector,Cargo,Salario
0,1968,Burgos,Jeronimo,Caseros,Administración,Administrativo,32000
1,1674,Villegas,Estefania,Caseros,Administración,Vendedor,32000
2,1516,Fernandez,Guillermo,Caseros,Administración,Vendedor,45000
3,1330,Ramirez,Eliana,Caseros,Administración,Vendedor,32000
4,1657,Carmona,Jose,Caseros,Administración,Vendedor,32000

In [19]:
productos = pd.read_excel("Homework/PRODUCTOS.xlsx")
productos.head()

   ID_PRODUCTO                            Concepto         Tipo   Precio
0        42737                  EPSON COPYFAX 2000    IMPRESIÓN  1658.00
1        42754    MOT ASROCK H110M-HDS S1151 S/VGA  INFORMATICA  1237.50
2        42755  MOT ASROCK A58M-VG3+ AMD FM2+ R2.0  INFORMATICA  1079.32
3        42756                  MOT ECS KAM1-I AM1  INFORMATICA   638.66
4        42757    MOT ASROCK B150M-HDS S1151 S/VGA  INFORMATICA  1784.42

In [20]:
proveedores = pd.read_excel("Homework/Proveedores.xlsx")
proveedores.head()

,IDProveedor,Nombre,Address,City,State,Country,departamen
0,1,NaN,BEREGUESTEIN 36,AVELLANEDA,BUENOS AIRES,ARGENTINA,AVELLANEDA
1,2,San Cirano,ALBERTI 965,CORONEL BRANDSEN,BUENOS AIRES,ARGENTINA,BRANDSEN
2,3,Bell S.A.,MORENO 331,CAMPANA,BUENOS AIRES,ARGENTINA,CAMPANA
3,4,Rivero Insumos,PTE. PERON 3872,VALENTIN ALSINA,BUENOS AIRES,ARGENTINA,LANUS
4,5,Laprida Computacion,AVDA. PEDRO PEREYRA 1339,LAPRIDA,BUENOS AIRES,ARGENTINA,LAPRIDA

In [16]:
compra = pd.read_csv("Homework/Compra.csv",sep=",",decimal=".")
compra.head()

   IdCompra       Fecha  IdProducto  Cantidad  Precio  IdProveedor
0         1  2015-01-30       42832        13  560.51           12
1         2  2015-01-30       42833        11  497.58            7
2         3  2015-01-30       42834         1  588.50            6
3         4  2015-01-30       42835         9  567.66           14
4         5  2015-01-30       42839        14  231.31            2

In [22]:
tipogasto = pd.read_csv("Homework/TiposDeGasto.csv",sep=",")
tipogasto

   IdTipoGasto         Descripcion  Monto_Aproximado
0            1            Alquiler              1000
1            2           Servicios               300
2            3           Impuestos               100
3            4  Sueldos y Jornales              1000

In [21]:
sucursales = pd.read_csv("Homework/Sucursales.csv",sep=";",decimal=",")
sucursales.head()

,ID,Sucursal,Direccion,Localidad,Provincia,Latitud,Longitud
0,1,Cabildo,Av. Cabildo 1342,Ciudad de Buenos Aires,Ciudad de Buenos Aires,-34.567806,-58.449572
1,2,Palermo 1,Guatemala 5701,CABA,CABA,-34.579035,-58.433566
2,3,Palermo 2,Gral. Lucio Norberto Mansilla 2668,CABA,C deBuenos Aires,-34.595966,-58.405150
3,4,Corrientes,Av. Corrientes 2352,Ciudad de Buenos Aires,Bs As,-34.604685,-58.398764
4,5,Almagro,Venezuela 3650,Capital,Bs.As.,-34.617308,-58.416179

In [18]:
gasto = pd.read_csv("homework/Gasto.csv",sep=",",decimal=".")
gasto

      IdGasto  IdSucursal  IdTipoGasto       Fecha    Monto
0           1          18            1  2015-01-01  1164.90
1           2          18            2  2015-01-01   317.02
2           3          18            3  2015-01-01   118.89
3           4          18            4  2015-01-01  1174.23
4           5           1            1  2015-01-01  1104.51
...       ...         ...          ...         ...      ...
8635     8636          23            4  2020-12-01  1180.27
8636     8637          24            1  2020-12-01  1152.15
8637     8638          24            2  2020-12-01   305.98
8638     8639          24            3  2020-12-01   104.32
8639     8640          24            4  2020-12-01  1156.31

[8640 rows x 5 columns]

In [23]:
venta = pd.read_csv("Homework/Venta.csv",sep=",",decimal=".")
venta.head()

,IdVenta,Fecha,Fecha_Entrega,IdCanal,IdCliente,IdSucursal,IdEmpleado,IdProducto,Precio,Cantidad
0,1,2018-03-09,2018-03-17,3,969,13,1674,42817,813.12,2.0
1,2,2018-12-28,2018-12-29,2,884,13,1674,42795,543.18,3.0
2,3,2016-03-28,2016-03-31,2,1722,13,1674,42837,430.32,1.0
3,4,2017-10-23,2017-10-24,3,2876,13,1674,42834,818.84,2.0
4,5,2017-11-22,2017-11-25,2,678,13,1674,42825,554.18,3.0

# Subir a base de datos

In [36]:
from sqlalchemy import create_engine
import pymysql
import psycopg2
import pandas as pd

In [37]:
conex = create_engine('mysql+pymysql://root:Alaver_456@localhost:3306/henry_3')

In [43]:
canalventa.to_sql(name="canalventa",con=conex,if_exists='replace',index=False)

3

In [44]:
clientes.to_sql(name="clientes",con=conex,if_exists="replace",index=False)

3407

In [45]:
compra.to_sql(name="compra",con=conex,if_exists="replace",index=False)

11539

In [46]:
empleados.to_sql(name="empleados",con=conex,if_exists="replace",index=False)

267

In [47]:
gasto.to_sql(name="gasto",con=conex,if_exists="replace",index=False)

8640

In [48]:
productos.to_sql(name="productos",con=conex,if_exists="replace",index=False)

291

In [49]:
proveedores.to_sql(name="proveedores",con=conex,if_exists="replace",index=False)

14

In [50]:
sucursales.to_sql(name="sucursales",con=conex,if_exists="replace",index=False)

31

In [51]:
tipogasto.to_sql(name="tipogasto",con=conex,if_exists="replace",index=False)

4

In [52]:
venta.to_sql(name="venta",con=conex,if_exists="replace",index=False)

46645